Azure/src/DataProcessors/СоздатьПапку/СоздатьПапку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СоздатьПапку</name>
  <attributes>
    <name>СтрокаПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShareName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DirectoryPath</name>
    <comment>Путь по которому будет создан файл (напр. files\)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>МетаТеги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Azure/src/DataProcessors/СоздатьПапку/Forms/Форма/Module.bsl
#Область ОбработкаСобытийФормы

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДопНастройки) Экспорт
	Если ВыбранныеФайлы <> Неопределено Тогда
		Объект.ПутьКФайлу = ВыбранныеФайлы[0];
	КонецЕсли; 			
КонецПроцедуры


#Область ОбработкаКомандФормы
&НаСервере
Функция СоздатьПапкуНаСервере()
	
	МетаТегиСохранить = Новый Структура;
	
	Для каждого МетаТег Из Объект.МетаТеги Цикл
		МетаТегиСохранить.Вставить(МетаТег.Тег, МетаТег.Значение);	
	КонецЦикла; 
	
	СтатусОтвет = AzureВызовСервера.СоздатьДиректориюAzureFile(
		Объект.СтрокаПодключения,
		Объект.DirectoryPath,
		Объект.ShareName,
		МетаТегиСохранить
	);
	
	Возврат СтатусОтвет;
КонецФункции

&НаКлиенте
Процедура СоздатьПапку(Команда)
	СтатусОтвет = СоздатьПапкуНаСервере();
	ВспомогательныйКлиент.ВывестиСтатус(СтатусОтвет);
КонецПроцедуры
#КонецОбласти 

#КонецОбласти
